IDEA StatiCa Open Model
SubStructureGeometry Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 SubStructureGeometry
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Model.SubStructureGeometry
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class SubStructureGeometry : OpenObject
Public Class SubStructureGeometry
	Inherits OpenObject
public ref class SubStructureGeometry : public OpenObject
The SubStructureGeometry type exposes the following members.
Constructors
Name | Description
SubStructureGeometry
 Constructor
Top
Properties
Name | Description
ConnectionPoints
 Array of connection points
RealMembers
 Array of DesignMemberInSubStructure
TheoreticalMembers
 Array of DesignMemberInSubStructure
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace